---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemBoltTotalWeight
source: html/d5e9340f-ab13-7c3d-6443-0efdcef84827.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemBoltTotalWeight Property

"Total Weight"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemBoltTotalWeight { get; }
```